tutorials/multiphase/interFoam/RAS/weirOverflow/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

restore0Dir

runApplication blockMesh
\cp 0/alpha.water.orig 0/alpha.water

runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
